# Base workstation tooling
bash-completion
btop
curl
dconf-editor
docker
docker-compose-plugin
fastfetch
fd-find
fzf
git
gnome-keyring
gnupg2
htop
jq
konsole
kwalletmanager5
neovim
nerd-fonts
pipewire-utils
podman
ripgrep
starship
tmux
unzip
vim
wget
zip

# Development languages and build tools
clang
cmake
gcc
gdb
golang
java-21-openjdk-devel
nodejs
npm
python3
python3-pip
python3-pipx
ruby
rust
cargo
